# Missing data
Let's show a few  convenient methods to deal with Missing Data in pandas:

In [2]:
import numpy as np
import pandas as pd

In [4]:
df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
# remove the rows which has nan value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
# remove the columns which has Nan

df.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
#remove the row which has nan

df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [14]:
#If I have thresh=3 it means i want 3 numbers in the rows


df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [17]:
# filing something 


df.fillna('Lohit')

       A      B  C
0      1      5  1
1      2  Lohit  2
2  Lohit  Lohit  3

In [18]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [19]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
df['A'].fillna(value=df['A'].std())

0    1.000000
1    2.000000
2    0.707107
Name: A, dtype: float64

In [23]:
df['A'].fillna(value=df['A'].sum())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64